[
  {
    "text": "Description: Adidas D.O.N. Issue #6 review: After our wear and lab tests, we can say the D.O.N. Issue #6 stands at the top of this series. Its supportive structure offered us wonderful containment, and its unbelievably sticky outsole maintained grip even on dusty courts! The best part is that this didn't come in a heavy design, as we moved quickly and safely through the court. The only issue here is that this Adidas hooper requires a break-in period. But don't worry, in our experience, it wasn't no way near as long and painful as other models' (yes LeBron 21, we're looking at you!).",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/adidas-don-issue-6",
      "score": 92,
      "price_min": 120,
      "price_max": 140,
      "sentiment_score": 5.0,
      "sentiment_label": "neutral",
      "source": "runrepeat",
      "keywords_performance": [
        "grip",
        "support"
      ],
      "keywords_playstyle": [
        "quick"
      ],
      "keywords_comfort": [
        "break-in"
      ],
      "keywords_durability": [
        "wear",
        "outsole"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Nike G.T. Cut 3 review: Nike went for a total revamp of the G.T. Cut 3 introducing it as the first-ever basketball shoe to use the cutting-edge ZoomX cushioning foam. This ultra-soft and responsive foam teamed up with the shoe's lightweight design to set our feet flying during the playtest! But as fun as that felt, we didn't think it was enough to justify the Cut 3's soaring price point. As a shoe that's meant for aggressive cuts, our primary concern was the lack of foot containment in the G.T. Cut 3. And we just couldn't let it slide.",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/nike-g-t-cut-3",
      "score": 88,
      "price_min": 135,
      "price_max": 200,
      "sentiment_score": 0.0,
      "sentiment_label": "negative",
      "source": "runrepeat",
      "keywords_performance": [
        "cushioning"
      ],
      "keywords_playstyle": [
        "cutting"
      ],
      "keywords_technologies": [
        "foam"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Nike LeBron 22 review: The LeBron XXII brings back its old aesthetics to become a dream come true for bigger players, centers and power forwards alike! This hooper offered top tier traction and an incredibly supportive structure that kept us on our feet even if we had to fight our defenders at the post. But that's not all, as it also comes full of incredibly efficient cushioning technologies that work all together to make this shoe's shock absorption absolutely delightful. Nevertheless, this solid design and materials make this Nike pair heavier than average.",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/nike-le-bron-22",
      "score": 91,
      "price_min": 135,
      "price_max": 190,
      "sentiment_score": 6.61,
      "sentiment_label": "neutral",
      "source": "runrepeat",
      "keywords_performance": [
        "traction",
        "cushioning",
        "support"
      ],
      "keywords_playstyle": [
        "forward",
        "center"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Adidas Dame 9 review: Damian Lillard has brought us another wonderful performer for the court. The Dame 9 features a wonderfully supportive and stable structure that let us go for the riskier moves during our wear tests, and thanks to its impact protection and responsiveness, we were never afraid to jump and hit our defenders mid-air. The lockdown feel it provided is immaculate, yet its solid materials just unavoidably send it to the heavier hoopers category.",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/adidas-dame-9",
      "score": 92,
      "price_min": 95,
      "price_max": 140,
      "sentiment_score": 7.0,
      "sentiment_label": "positive",
      "source": "runrepeat",
      "keywords_performance": [
        "support",
        "responsiveness",
        "lockdown",
        "impact protection"
      ],
      "keywords_durability": [
        "wear"
      ],
      "keywords_technologies": [
        "air"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Adidas Harden Vol. 9 review: The Vol. 8 was already a reliable solid performer, but it seems the Vol. 9 is here to double it up! It keeps the same solid and trustworthy design, featuring a durable yet breathable structure that offers wonderful support and containment. During our wear tests, we also noticed its snappy nature and bounce, as it pushed us back up every time we landed after a rebound or a jump shot. Nevertheless, despite being the lightest of their siblings, this hooper is still on the heavier side of its category. The solid lock-in feel and traction make this pair ideal for quick guards, but its weight might be a drawback.",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/adidas-harden-vol-9",
      "score": 90,
      "price_min": 135,
      "price_max": 200,
      "sentiment_score": 10.0,
      "sentiment_label": "positive",
      "source": "runrepeat",
      "keywords_performance": [
        "traction",
        "support",
        "bounce"
      ],
      "keywords_playstyle": [
        "guard",
        "quick"
      ],
      "keywords_comfort": [
        "breathable"
      ],
      "keywords_durability": [
        "durable",
        "wear"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: New Balance Fresh Foam BB v2 review: New Balance is back with another hooper that features its wonderful Fresh Foam cushioning. The Fresh Foam BB v2 offers insane impact protection, and its structure is comfortable from the very first minute. Its upper is durable and very reinforced, so we could enjoy wonderful support during our games. This was also thanks to its double heel counter and its rubberized lateral walls, which wrapped around our feet comfortably. We believe one of the best selling points of this shoe is not just its solid traction even on dusty courts, but the fact that it protects your feet from any damage after jumping thanks to its shock-absorbing properties. We couldn't feel the court at all though, but we understand New Balance sacrificed that to offer the softest of landings.",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/new-balance-fresh-foam-bb-v2",
      "score": 87,
      "price_min": 120,
      "price_max": 160,
      "sentiment_score": 10.0,
      "sentiment_label": "positive",
      "source": "runrepeat",
      "keywords_performance": [
        "traction",
        "cushioning",
        "support",
        "impact protection"
      ],
      "keywords_playstyle": [
        "jumping"
      ],
      "keywords_features": [
        "fresh foam"
      ],
      "keywords_comfort": [
        "comfortable"
      ],
      "keywords_durability": [
        "durable"
      ],
      "keywords_technologies": [
        "foam"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: New Balance TWO WXY V5 review: The TWO WXY V5 is one of the safest bets you could possibly find. Its wonderful versatility and playability adapt smoothly to the different basketball positions, and it worked wonders on outdoor and indoor courts. We felt quick and energetic on the offense, and its stability and support made us feel safe and sound on the defense. Overall, we believe this New Balance pair gives you a little bit of everything, and as long as you don't mind break-in periods, you'll get to enjoy all its advantages. No matter if you're a beginner or a veteran hooper!",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/new-balance-two-wxy-v5",
      "score": 88,
      "price_min": 85,
      "price_max": 135,
      "sentiment_score": 0.0,
      "sentiment_label": "negative",
      "source": "runrepeat",
      "keywords_performance": [
        "support",
        "stability"
      ],
      "keywords_playstyle": [
        "quick"
      ],
      "keywords_court_type": [
        "indoor",
        "outdoor"
      ],
      "keywords_comfort": [
        "break-in"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Air Jordan XXXIX review: The tale of the Air Jordan XXXIX is the one of what could have been but never was. We felt we could reach the skies just like Jordan did thanks to the incredible bounce and energy return we felt every time we played. This also made the shoe incredibly comfortable, shielding us from the harsh court when we jumped. Nevertheless, the explosion of energy we felt on our feet was totally and dangerously uncontrolled. So, even though we found this AJ amazing for static shooting drills, it's too unstable for us to play comfortably quick with it.",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/air-jordan-xxxix",
      "score": 87,
      "price_min": 135,
      "price_max": 200,
      "sentiment_score": 7.14,
      "sentiment_label": "positive",
      "source": "runrepeat",
      "keywords_performance": [
        "energy return",
        "bounce"
      ],
      "keywords_playstyle": [
        "quick"
      ],
      "keywords_comfort": [
        "comfortable"
      ],
      "keywords_technologies": [
        "air"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Nike Ja 2 review: Morant is back with another solid hooper. The Ja 2 is a low-profile shoe that offers wonderful traction and court feel for the fastest guards. Its lightweight yet springy build accompanied our most explosive moves during the wear tests, as its Air Zoom unit pushed us back up every time we landed after a rebound or a jump shot. Nevertheless, even though we're pretty happy with this Nike pair's performance, its materials feel as cheap as they ones from the previous iteration.",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/nike-ja-2",
      "score": 92,
      "price_min": 120,
      "price_max": 150,
      "sentiment_score": 6.67,
      "sentiment_label": "neutral",
      "source": "runrepeat",
      "keywords_performance": [
        "traction",
        "court feel"
      ],
      "keywords_playstyle": [
        "guard",
        "explosive"
      ],
      "keywords_durability": [
        "wear"
      ],
      "keywords_technologies": [
        "air",
        "zoom"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Adidas Anthony Edwards 1 Low review: The Anthony Edwards 1 Low managed to leave us open-mouthed after our wear and lab tests. Its solid upper offered us wonderful containment and durability, so it was ready for our most aggressive plays. Its firm underfoot feel and cushioning also contributed to this, as we never lost our balance. But the best part is that its amazing traction and low profile kept us close to court and in control no matter what. Even though all this sounds like the perfect match for quick guards, thanks to our scale we found out this Adidas hooper is pretty heavy, which might not be faster players' cup of tea.",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/adidas-anthony-edwards-1-low",
      "score": 89,
      "price_min": 100,
      "price_max": 135,
      "sentiment_score": 10.0,
      "sentiment_label": "positive",
      "source": "runrepeat",
      "keywords_performance": [
        "traction",
        "cushioning"
      ],
      "keywords_playstyle": [
        "guard",
        "quick"
      ],
      "keywords_durability": [
        "wear"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Nike G.T. Cut Academy review: The G.T. Cut Academy is the takedown model of the Nike G.T. Cut 3, but its affordable price tag comes full of advantages! This Nike pair features a tough upper and extra eyelets at the top that offer a customized fit. We enjoyed the containment and lockdown feel of this shoe in every step, as our cuts were propelled by its Zoom Air unit on the forefoot. Even though we could fly up and down the court thanks to its lightweight structure, this shoe's materials are not the most durable out there. If you're looking for a pair of hoopers that stay by your side for a longer time, investing in a more expensive model might be worth it!",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/nike-gt-cut-academy",
      "score": 87,
      "price_min": 85,
      "price_max": 135,
      "sentiment_score": 10.0,
      "sentiment_label": "positive",
      "source": "runrepeat",
      "keywords_performance": [
        "lockdown"
      ],
      "keywords_features": [
        "zoom air"
      ],
      "keywords_durability": [
        "durable"
      ],
      "keywords_technologies": [
        "air",
        "zoom"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Nike KD 17 review: Get ready to reap not only souls but also hearts with Kevin Durant's new signature shoe, the KD 17. This Nike model offers incredible support thanks to its exoskeleton structure and TPU details. Additionally, its sole flare, Air Strobel (heel), and Zoom Air (forefoot) make sure the feet land safely and softly. We loved the way its wavy outsole bit the floor, winning the traction fight even against dusty courts. Last but not least, the KD 17's lateral guard for toe-dragging moves allows it to have a mesh upper that increases airflow, making it wonderful to play when temperatures go up. Nevertheless, its stable and foot-locking design is not the best for wide-foot hoopers, as their toes will most likely be cramped!",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/nike-kd-17",
      "score": 89,
      "price_min": 120,
      "price_max": 160,
      "sentiment_score": 6.58,
      "sentiment_label": "neutral",
      "source": "runrepeat",
      "keywords_performance": [
        "traction",
        "support"
      ],
      "keywords_playstyle": [
        "guard"
      ],
      "keywords_features": [
        "zoom air",
        "mesh"
      ],
      "keywords_comfort": [
        "wide"
      ],
      "keywords_durability": [
        "outsole"
      ],
      "keywords_materials": [
        "mesh"
      ],
      "keywords_technologies": [
        "air",
        "zoom"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Nike Sabrina 2 review: Much like its older sibling, the Sabrina 1, this second iteration is here to create another revolution. Its top-tier performance and playability made us want to play with it over and over again, just like its incredibly lightweight and fast structure. Even though we barely felt it in our feet, it features super durable materials and a wonderful cushioning set up (the most advanced Cushlon foam + an Air Zoom unit). It also provides loads of court feel, yet this Nike's outsole will have a hard time withstanding outdoor courts if you're planning to wear it as much as we did.",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/nike-sabrina-2",
      "score": 90,
      "price_min": 80,
      "price_max": 160,
      "sentiment_score": 6.52,
      "sentiment_label": "neutral",
      "source": "runrepeat",
      "keywords_performance": [
        "cushioning",
        "court feel"
      ],
      "keywords_court_type": [
        "outdoor"
      ],
      "keywords_durability": [
        "durable",
        "wear",
        "outsole"
      ],
      "keywords_technologies": [
        "air",
        "foam",
        "zoom"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Puma All Pro Nitro review: Our test games and lab assessments reveal that the PUMA All Pro Nitro is a dependable basketball shoe, even on outdoor courts (occasionally). We were happy with the comfort, grip, stability, and speedy lightness that we felt while wearing it. This offer from PUMA is surely a must-try considering how much value it offers for its moderate price point.",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/puma-all-pro-nitro",
      "score": 90,
      "price_min": 120,
      "price_max": 135,
      "sentiment_score": 10.0,
      "sentiment_label": "positive",
      "source": "runrepeat",
      "keywords_performance": [
        "grip",
        "stability"
      ],
      "keywords_playstyle": [
        "speed"
      ],
      "keywords_court_type": [
        "outdoor"
      ],
      "keywords_durability": [
        "wear"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Nike Book 1 review: The Nike Book 1 is the first signature shoe for Devin Booker, and it couldn't get any more stylish than that! The First Chapter of what we expect to be many more, we found this hooper to be the ideal partner for quick players who make last-minute decisions, dribbles, or cuts. Once the break-in period is over, its comfort levels go up like crazy. During our wear tests, we enjoyed the safety and snug feel of all its padding, as well as its coziness. Its traction was impressive, but what left us in awe were this shoe's incredible visuals. The Book 1 has a bball soul in an AF1 body, and we loved every bit of it! It doubles as a sneaker, but we wouldn't wear it in the summer: it's not breathable at all!",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/nike-book-1",
      "score": 87,
      "price_min": 130,
      "price_max": 140,
      "sentiment_score": 7.38,
      "sentiment_label": "positive",
      "source": "runrepeat",
      "keywords_performance": [
        "traction"
      ],
      "keywords_playstyle": [
        "quick"
      ],
      "keywords_comfort": [
        "break-in",
        "snug",
        "padding",
        "breathable"
      ],
      "keywords_durability": [
        "wear"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Under Armour Curry 11 review: The Curry 11 is here as a revolutionary update compared with the previous models. Its now solidified upper offers durability and breathability, apart from great support. The external heel counter adds up to this last part, as its TPU structure holds the Achilles, leaving room for the joint to move freely and make explosive and daring drills possible. We felt light and fast in this shoe, which we believe is ideal for guards with quick and nimble footwork. But our favorite part was the crazy traction of the outsole, as it grip literally on every surface. Nevertheless, its rubber is incredibly soft and weak to abrasion, so it's better not to use this UA pair outdoors; or you'll have to say goodbye to it sooner than expected!",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/under-armour-curry-11",
      "score": 89,
      "price_min": 80,
      "price_max": 160,
      "sentiment_score": 10.0,
      "sentiment_label": "positive",
      "source": "runrepeat",
      "keywords_performance": [
        "traction",
        "grip",
        "support"
      ],
      "keywords_playstyle": [
        "guard",
        "quick",
        "explosive"
      ],
      "keywords_court_type": [
        "outdoor"
      ],
      "keywords_durability": [
        "outsole"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Jordan Luka 3 review: The Luka 3 is here to turn the hoopers' world upside down. Its flexible and accommodating structure breaks with the past stiffer versions, providing smooth transitions and movements that require constant bending of the ball of the foot (like pretty much any kind of fake, for example). It features an IsoPlate and heavily padded interiors that add up to the tough upper material to offer wonderful foot lockdown and containment. Traction is yet another highlight of the Luka 3. It encouraged us to try more daring moves along with the shoe's supportive and stable structure. The only drawback here is that it feels like Jordan didn't try hard with this shoe even with its price, as it doesn't feature very high-quality materials or specific Nike technologies.",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/jordan-luka-3",
      "score": 89,
      "price_min": 120,
      "price_max": 140,
      "sentiment_score": 10.0,
      "sentiment_label": "positive",
      "source": "runrepeat",
      "keywords_performance": [
        "traction",
        "support",
        "lockdown"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Nike Precision 7 review: We couldn't believe our eyes when we read the Precision 7 is a budget shoe from Nike. It performed incredibly well and got fantastic scores in our lab and wear tests! Its upper mixes durability and breathability perfectly, which allows us to play non-stop even on the hottest days of the summer. But there's more: its quality materials offer great support and stability for unexpected moves! Overall, we believe this shoe is fantastic for hoopers with a quick playstyle thanks to its lightweight design and low-profile nature, as we could feel the court under our feet. Nevertheless, its midsole and insole are pretty simple, which means no cool Nike technologies around!",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/nike-precision-7",
      "score": 81,
      "price_min": 80,
      "price_max": 150,
      "sentiment_score": 6.71,
      "sentiment_label": "neutral",
      "source": "runrepeat",
      "keywords_performance": [
        "support",
        "stability"
      ],
      "keywords_playstyle": [
        "quick"
      ],
      "keywords_durability": [
        "wear"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Reebok Question Mid review: The Reebok Question Mid is a timeless Allen Iverson silhouette. Its visual appeal and comfy interiors are certainly what initially captured us. Due to this, we were perfectly confident in using it even for casual wear. Performance-wise, we found it to be just as grippy and responsive as its low-top counterpart, the Question Low, but with a much more supportive ankle collar.",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/reebok-question-mid",
      "score": 90,
      "price_min": 125,
      "price_max": 170,
      "sentiment_score": 10.0,
      "sentiment_label": "positive",
      "source": "runrepeat",
      "keywords_performance": [
        "grip",
        "support"
      ],
      "keywords_durability": [
        "wear"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Nike LeBron Witness 8 review: The Witness 8 symbolizes a wonderful improvement on this budget line from LeBron. For a fair price, you get pretty good cushioning (plus an Air Max unit at the heel!) and fantastic traction even on dusty courts. Its upper durability is much better, yet that didn't make it any less comfortable thanks to all its padding. Listening to all of us hoopers, Nike added reinforced and structural layers to this newest model to improve containment and support. Nevertheless, during our wear tests we didn't find it stable enough to perform riskier moves.",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/nike-lebron-witness-8",
      "score": 83,
      "price_min": 90,
      "price_max": 135,
      "sentiment_score": 6.57,
      "sentiment_label": "neutral",
      "source": "runrepeat",
      "keywords_performance": [
        "traction",
        "cushioning",
        "support"
      ],
      "keywords_features": [
        "air max"
      ],
      "keywords_comfort": [
        "comfortable",
        "padding"
      ],
      "keywords_durability": [
        "wear"
      ],
      "keywords_technologies": [
        "air"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Nike Giannis Immortality 4 review: The Giannis Immortality 4 is the new member of the budget that doesn't feel like a budget line of Nike. Its incredible support and stability favor hoopers with a quick playstyle. As it maintains the same design of its predecessors, it's very versatile, so it suits any position. We believe its affordability makes it a great option for a wide public, but it might not have enough impact protection for heavy players or big centers who focus on rebounding and constant jumping.",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/nike-giannis-immortality-4",
      "score": 84,
      "price_min": 85,
      "price_max": 140,
      "sentiment_score": 10.0,
      "sentiment_label": "positive",
      "source": "runrepeat",
      "keywords_performance": [
        "support",
        "stability",
        "impact protection"
      ],
      "keywords_playstyle": [
        "center",
        "quick",
        "jumping"
      ],
      "keywords_comfort": [
        "wide"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Adidas Harden Vol. 8 review: Harden is back with the Vol 8 of his bball beasts! This new iteration features a durable bootie construction that hugged our feet comfortably in every game we played. Its foot containment is just otherworldly, and its supportive structure helped us land confidently after rebounding. The best part of this is that its Jet Boost foam pushed us back up thanks to its bounce, keeping our feet comfortable due to fantastic shock-absorbing properties. Overall, the Adidas Harden Volume 8 is a smooth shoe that moved easily alongside our feet during our wear tests, but we didn't find it fast enough for players with quick footwork.",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/adidas-harden-volume-8",
      "score": 90,
      "price_min": 135,
      "price_max": 160,
      "sentiment_score": 10.0,
      "sentiment_label": "positive",
      "source": "runrepeat",
      "keywords_performance": [
        "support",
        "bounce"
      ],
      "keywords_playstyle": [
        "quick"
      ],
      "keywords_features": [
        "boost"
      ],
      "keywords_comfort": [
        "comfortable"
      ],
      "keywords_durability": [
        "durable",
        "wear"
      ],
      "keywords_technologies": [
        "foam",
        "boost"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Nike Lebron NXXT GEN review: The Nike LeBron NXXT Gen is a badass shoe, we just have to be very clear on this. As a lightened version of the LeBron 20, it fuses LeBron's famous impact protection with an excellent ground feel which results in more solid control over footwork. We highly recommend getting this shoe if you plan to get aggressive on the court.",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/nike-lebron-nxxt-gen",
      "score": 87,
      "price_min": 110,
      "price_max": 200,
      "sentiment_score": 6.91,
      "sentiment_label": "neutral",
      "source": "runrepeat",
      "keywords_performance": [
        "impact protection"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Nike Sabrina 1 review: Sabrina Ionescu, a well-known WNBA star, has finally launched her first signature shoe, and it's an incredibly solid model! This pair's great success has been demonstrated by our lab and wear tests, as it constantly got fantastic scores and showed its wonderful performance. Its 1-to-1 fit and supportive structure work hand in hand with its natural flexibility, giving us the confidence we needed to perform in-n-out and many other explosive moves. As it's also pretty lightweight, we felt fast with it, which we believe is ideal for quick guards and forwards that shine because of their speedy footwork. Its close-to-the-ground structure and cushioning technologies gave us the best of both worlds, levelling up this shoe's efficiency to the max. But it's a Nike model after all, so we wouldn't recommend it to wide-foot hoopers. Overall, we couldn't be happier with this first release.",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/nike-sabrina-1",
      "score": 86,
      "price_min": 125,
      "price_max": 150,
      "sentiment_score": 6.76,
      "sentiment_label": "neutral",
      "source": "runrepeat",
      "keywords_performance": [
        "cushioning",
        "support"
      ],
      "keywords_playstyle": [
        "guard",
        "forward",
        "quick",
        "explosive",
        "speed"
      ],
      "keywords_comfort": [
        "wide"
      ],
      "keywords_durability": [
        "wear"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Nike LeBron 21 review: LeBron shoes create a lot of hype in general, but the 21 is absolutely worth the energy. With Zoom Turbo in the forefoot, a shank in the midfoot, and Zoom Air in the heel, its cushioning system is spot on! We experienced a great mix of bounce and shock absorption, so playing in these hoopers was great fun. Despite being ready to jump, the 21 didn't feel unstable or wobbly, as its substantial structure made us surefooted in every single one of our game tests. Its high-quality materials definitely also made it a quite durable pair and helped us prevent ankle injuries. Just keep in mind that your feet will suffer throughout the long and harsh break-in period these LeBrons need. The shoe's skyrocketed price might hurt your wallet too, but it's definitely worth every penny!",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/nike-lebron-21",
      "score": 86,
      "price_min": 130,
      "price_max": 210,
      "sentiment_score": 10.0,
      "sentiment_label": "positive",
      "source": "runrepeat",
      "keywords_performance": [
        "cushioning",
        "bounce"
      ],
      "keywords_features": [
        "zoom air"
      ],
      "keywords_comfort": [
        "break-in"
      ],
      "keywords_durability": [
        "durable"
      ],
      "keywords_technologies": [
        "air",
        "zoom"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Nike G.T. Hustle 3 review: The G.T. Hustle 3 breaks completely with the previous iteration, offering an incredibly breathable and cushioned structure. We couldn't get enough of its wonderful Nike technologies (Zoom Air) during our wear tests, as they offered shock absorption, great bounce, and a comfortable ride. We enjoyed the snug fit of this Nike pair, as its lightweight design and fantastic traction helped us with faster moves (like back-door cuts, for example). The problem is that its high-quality design is not on the affordable side, as it also fixed many of the negative aspects of its predecessor. It's quite an investment, but we do believe it's definitely worth it!",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/nike-gt-hustle-3",
      "score": 83,
      "price_min": 120,
      "price_max": 190,
      "sentiment_score": 6.79,
      "sentiment_label": "neutral",
      "source": "runrepeat",
      "keywords_performance": [
        "traction",
        "bounce"
      ],
      "keywords_features": [
        "zoom air"
      ],
      "keywords_comfort": [
        "comfortable",
        "snug",
        "breathable"
      ],
      "keywords_durability": [
        "wear"
      ],
      "keywords_technologies": [
        "air",
        "zoom"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Nike Ja 1 review: The anticipation for Ja Morant's first signature shoe with Nike is pretty much justified. The Nike Ja 1 is a total performer that we recommend for different kinds of players: from guards who appreciate a lot of energy return to heel strikers and bigger men who need good impact protection. It also feels comfortable enough to be worn off the court. You can really maximize the money spent on this hoop shoe.",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/nike-ja-1",
      "score": 89,
      "price_min": 110,
      "price_max": 150,
      "sentiment_score": 10.0,
      "sentiment_label": "positive",
      "source": "runrepeat",
      "keywords_performance": [
        "energy return",
        "impact protection"
      ],
      "keywords_playstyle": [
        "guard"
      ],
      "keywords_comfort": [
        "comfortable"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Nike Giannis Freak 6 review: The Giannis Freak 6 is back to be every player's cup of tea. Its versatility lets it fit different playstyles, as it feels fast yet stable on foot. No matter if you post-play a lot or if you're more of a dribble-tricky player, this Nike pair will work with you. It features a springy Zoom Air Unit and a low profile structure that balance each other out in the best way possible. Nevertheless, we believe it lacks support for its price, which was disappointing.",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/nike-giannis-freak-6",
      "score": 84,
      "price_min": 85,
      "price_max": 150,
      "sentiment_score": 6.67,
      "sentiment_label": "neutral",
      "source": "runrepeat",
      "keywords_performance": [
        "support"
      ],
      "keywords_features": [
        "zoom air"
      ],
      "keywords_technologies": [
        "air",
        "zoom"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Adidas Dame 8 review: The Adidas Dame 8 is another shoe from the Damian Lillard series that delivers on aspects that matter. It is supportive, bouncy, and light, and offers a decent amount of court feel. However, we found that it has serious issues with traction on dusty courts, which some players may consider as a deal-breaker.",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/adidas-dame-8",
      "score": 89,
      "price_min": 120,
      "price_max": 135,
      "sentiment_score": 5.0,
      "sentiment_label": "neutral",
      "source": "runrepeat",
      "keywords_performance": [
        "traction",
        "support",
        "court feel"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Adidas Harden Vol. 7 review: We have reason to believe that nimble guards and big players are going to have lots of fun playing in Adidas Harden Vol. 7 shoes. This basketball shoe's design effectively ensures control, energy return, and confidence during our games. Additionally, the remarkable traction of this shoe made us unstoppable inside the court.",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/adidas-harden-vol-7",
      "score": 91,
      "price_min": 125,
      "price_max": 170,
      "sentiment_score": 7.06,
      "sentiment_label": "positive",
      "source": "runrepeat",
      "keywords_performance": [
        "traction",
        "energy return"
      ],
      "keywords_playstyle": [
        "guard"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Adidas Trae Young 3 review: With stability as its number one priority, Adidas is back with another Torsion System-equipped hooper. We've found the Adidas Trae Young 3 is a perfect match for those players who want to perform like the NBA's most aggressive guards and need a pair of kicks to keep up with their quick game. In our wear tests, this shoe made us feel stable and surefooted in our every move. And in our lab tests, we discovered it focuses on keeping it low to the ground, so it doesn't have the plushest midsole. Still, we believe it's ideal for athletes who are agile and quick on the court. If your playstyle is all about imposing offenses, sudden sprints, precise dribbling, and dominant cuts, make sure you sign this new assist leader of your shoe game!",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/adidas-trae-young-3",
      "score": 89,
      "price_min": 95,
      "price_max": 140,
      "sentiment_score": 10.0,
      "sentiment_label": "positive",
      "source": "runrepeat",
      "keywords_performance": [
        "stability"
      ],
      "keywords_playstyle": [
        "guard",
        "quick",
        "agile"
      ],
      "keywords_durability": [
        "wear"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Nike Lebron 20 review: The LeBron 20 definitely looks much more toned down, so it is visually different from the previous Nike LeBrons; yet, we found its performance as big as ever. It serves our needs for not only a lot of impact protection but also agility on the court. It's already a bonus that this shoe has the looks for off-the-court action.",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/nike-lebron-20",
      "score": 94,
      "price_min": 135,
      "price_max": 200,
      "sentiment_score": 5.0,
      "sentiment_label": "neutral",
      "source": "runrepeat",
      "keywords_performance": [
        "impact protection"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Nike G.T. Hustle 2 review: Aptly named, the Nike G.T. Hustle 2 is meant for light players whose playing style involves a lot of running on the court. Our playtests confirmed that the shoe inherits the fast-moving personality of its predecessor, the G.T. Run. Exceptionally light, minimal, and responsive, the Hustle 2 is fun to play in if you want to lose the stiffness and bulkiness of most hoop shoes these days. We loved the natural movement and court connection that this Nike shoe has to offer.",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/nike-gt-hustle-2",
      "score": 86,
      "price_min": 135,
      "price_max": 200,
      "sentiment_score": 6.83,
      "sentiment_label": "neutral",
      "source": "runrepeat"
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Nike KD 16 review: Kevin Durant's shoes are always surrounded by the hypest of hypes, and we couldn't agree more! The KD 16 came to our lab with one thing in mind: make our performance and confidence on the court reach new levels thanks to its incredible lookdown and supportiveness. Its padded and comfortable interiors just made the whole experience even better, blessing us with a comfortable ride. We felt its snappy forefoot give us an extra boost of energy every time we went for aggressive moves. And its lightweight nature let us go for more advanced dribbling or footwork with ease. We loved its fashionable design so much that this hoop could easily conquer the streets. Just don't take it out in the summer, or else your feet will have the works pool party ever: sweat, sweat, and more sweat!",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/nike-kd-16",
      "score": 86,
      "price_min": 135,
      "price_max": 190,
      "sentiment_score": 7.07,
      "sentiment_label": "positive",
      "source": "runrepeat",
      "keywords_performance": [
        "support"
      ],
      "keywords_features": [
        "boost"
      ],
      "keywords_court_type": [
        "street"
      ],
      "keywords_comfort": [
        "comfortable"
      ],
      "keywords_technologies": [
        "boost"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Nike Lebron Witness 7 review: In our opinion, up to a certain extent, the LeBron Witness 7 is practically just the Nike LeBron 20 but less pricey and more suitable for outdoor use. From aspects that are truly important such as traction and cushioning down to matters that are only peripherally valuable such as looks, we found that the LeBron Witness 7 delivers.",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/nike-lebron-witness-7",
      "score": 88,
      "price_min": 105,
      "price_max": 190,
      "sentiment_score": 5.0,
      "sentiment_label": "neutral",
      "source": "runrepeat",
      "keywords_performance": [
        "traction",
        "cushioning"
      ],
      "keywords_court_type": [
        "outdoor"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Adidas D.O.N. Issue #5 review: Donovan \"Spida\" Mitchell is back again with a new shoe, the D.O.N. Issue 5. According to our lab and wear tests, this model focuses on traction and containment. We felt quick and surefooted in our games thanks to its stable yet streamlined structure, which features some extra arch support on the medial area in the form of the Three Stripes Adidas logo. Its outsole showed outstanding performance regarding traction outdoors and indoors, beating even dusty courts after a couple of wipes. Nevertheless, its upper and outsole materials aren't the most durable, so you might need to change hooping pals sooner rather than later.",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/adidas-don-issue-5",
      "score": 90,
      "price_min": 100,
      "price_max": 135,
      "sentiment_score": 10.0,
      "sentiment_label": "positive",
      "source": "runrepeat",
      "keywords_performance": [
        "traction",
        "support"
      ],
      "keywords_playstyle": [
        "quick"
      ],
      "keywords_court_type": [
        "indoor",
        "outdoor"
      ],
      "keywords_comfort": [
        "arch support"
      ],
      "keywords_durability": [
        "durable",
        "wear",
        "outsole"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Jordan Luka 2 review: Much like the first Doncic shoe, the Jordan Luka 2 boasts exceptional stability. It locked our feet so securely in place that we never once felt a hint of wobble. We believe that shifter players who often make forceful side-to-side cuts will adore this shoe. It inspires a great deal of confidence for moving aggressively on the court (as long as it's a clean indoor court).",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/jordan-luka-2",
      "score": 87,
      "price_min": 130,
      "price_max": 140,
      "sentiment_score": 6.88,
      "sentiment_label": "neutral",
      "source": "runrepeat",
      "keywords_performance": [
        "stability"
      ],
      "keywords_court_type": [
        "indoor"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Nike Cosmic Unity 3 review: The Nike Cosmic Unity 3 is an investment that will give a lot of returns. We believe that this is the case where a high price tag is absolutely justified. For us, this shoe is an instant top pick in the durability and stability departments. And for sure, it is among the best options for outdoor use that we've seen in a while. If Nike fixes its firm midsole and trims down the weight for the next iteration, we are ready to claim it as THAT SHOE.",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/nike-cosmic-unity-3",
      "score": 82,
      "price_min": 120,
      "price_max": 190,
      "sentiment_score": 10.0,
      "sentiment_label": "positive",
      "source": "runrepeat",
      "keywords_performance": [
        "stability"
      ],
      "keywords_court_type": [
        "outdoor"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Nike Giannis Immortality 3 review: Nike is back with another budget shoe that doesn't feel like a budget shoe! (Yes, Precision 7, we're looking at you). The Giannis Immortality 3 is here to be your partner no matter which position you play, as it's an incredibly solid all-rounder. It features Nike's Renew foam, which gave us that instant pop for quick plays, as well as a wide base for landings, and two long flex grooves in the outsole that favored lateral movements. As you can see, it's built for attack specialists, defense lovers, and anything in between! The only problem that we encountered during our wear tests playing basketball with the Immortality 3 is that its midsole bottoms out if you're on the heavy side or after constant use. Keep it in mind before you go for a pair!",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/nike-giannis-immortality-3",
      "score": 84,
      "price_min": 80,
      "price_max": 140,
      "sentiment_score": 7.5,
      "sentiment_label": "positive",
      "source": "runrepeat",
      "keywords_playstyle": [
        "quick",
        "lateral movement"
      ],
      "keywords_comfort": [
        "wide"
      ],
      "keywords_durability": [
        "wear",
        "outsole"
      ],
      "keywords_technologies": [
        "foam"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Jordan Tatum 2 review: When the Tatum 2 came out, we could definitely tell that Jordan listened to its customers. This shoe's structure has not only improved regarding its outsole coverage and traction but also its overall lockdown feel and suredfootness. During our playtests, we enjoyed the mix of its full-length Air Strobel for our landings, and the wonderful court feel its low midsole offered. It gave us more control of our moves and we felt more confident in the court. Nevertheless, this shoe's cushioning might feel pretty dull, so we wouldn't go for it if you're looking for a responsive hooper!",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/jordan-tatum-2",
      "score": 88,
      "price_min": 100,
      "price_max": 190,
      "sentiment_score": 5.0,
      "sentiment_label": "neutral",
      "source": "runrepeat",
      "keywords_performance": [
        "traction",
        "cushioning",
        "lockdown",
        "court feel"
      ],
      "keywords_durability": [
        "outsole"
      ],
      "keywords_technologies": [
        "air"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Under Armour Lockdown 6 review: The Under Armour Lockdown 6 is among the cheapest models that we tried from the brand. Even though it doesn't scream performance, the shoe has all the basics and we recommend it for players who are only trying their hand at basketball. Considering that you can get this shoe with a good discount these days, it is practically a free pair of entry-level kicks! And if it doesn't work for basketball, you can still wear this looker out and about.",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/under-armour-lockdown-6",
      "score": 88,
      "price_min": 70,
      "price_max": 135,
      "sentiment_score": 7.0,
      "sentiment_label": "positive",
      "source": "runrepeat",
      "keywords_performance": [
        "lockdown"
      ],
      "keywords_durability": [
        "wear"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Adidas D.O.N. Issue #4 review: The Adidas D.O.N. Issue #4 comes with a highly stable platform and lighter-than-average build which allowed us to stay quick yet surefooted on our feet. For a low-top, this hoop shoe felt amazingly supportive! It may be a disappointment to those searching for incredible energy return as it highlights court feel and flexibility. Overall, we believe that it is a great value for money at his price point.",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/adidas-d-o-n-issue-4",
      "score": 88,
      "price_min": 95,
      "price_max": 135,
      "sentiment_score": 6.58,
      "sentiment_label": "neutral",
      "source": "runrepeat",
      "keywords_performance": [
        "support",
        "court feel",
        "energy return"
      ],
      "keywords_playstyle": [
        "quick"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Reebok Shaq Attaq review: The Reebok Shaq Attaq is definitely worth setting our funds back by $160. It is undoubtedly one of the most collectible basketball shoes we have ever tested, being highly comfortable, firm, and resistant to bottoming out. Since this shoe is modeled after a big man like Shaquille O’Neal, we found it suitable for big men and players who play the center position.",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/reebok-shaq-attaq",
      "score": 88,
      "price_min": 130,
      "price_max": 170,
      "sentiment_score": 10.0,
      "sentiment_label": "positive",
      "source": "runrepeat",
      "keywords_playstyle": [
        "center"
      ],
      "keywords_comfort": [
        "comfortable"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Adidas Harden Stepback 3 review: The Adidas Harden Stepback 3 is good news to those who want to perform like they're on the NBA but they don't have the NBA's players salary. This shoe worked wonders when we were in a triple threat position or when we tried any related moves. If you are more of an offensive player or go for that post up plays, we totally recommend it. It's definitely one of the best picks in its price range. Give it a shot, you'll definitely score!",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/adidas-harden-stepback-3",
      "score": 88,
      "price_min": 95,
      "price_max": 135,
      "sentiment_score": 6.57,
      "sentiment_label": "neutral",
      "source": "runrepeat"
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: PUMA Court Rider review: For its modest price point, the PUMA Court Rider offers quite a few benefits. We didn't expect much from this budget-friendly shoe and yet it surprised us on many fronts. With its notable court feel and responsiveness, we believe that this shoe will suit agile guards the best.",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/puma-court-rider",
      "score": 86,
      "price_min": 95,
      "price_max": 135,
      "sentiment_score": 6.56,
      "sentiment_label": "neutral",
      "source": "runrepeat",
      "keywords_performance": [
        "responsiveness",
        "court feel"
      ],
      "keywords_playstyle": [
        "guard",
        "agile"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Nike Zoom Freak 4 review: We found that the Nike Zoom Freak 4 is a worthy follow-up to the Freak 3s because of the noticeable improvement that it brings. It brings out the best in us, especially those among us who do a lot of rebounds and fast runs to the basket because of the high levels of energy that it returns with every step. It's pretty safe to say that this basketball shoe from Nike is worth every penny spent on it.",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/nike-zoom-freak-4",
      "score": 88,
      "price_min": 90,
      "price_max": 150,
      "sentiment_score": 10.0,
      "sentiment_label": "positive",
      "source": "runrepeat",
      "keywords_technologies": [
        "zoom"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Jordan Tatum 1 review: The Jordan Tatum 1 is the first signature shoe for Jason Tatum. Even as the older sibling of a series, this model left us in awe with its incredible style and visuals. What's more, its materials managed to balance average durability and breathability. We loved its forefoot design, as it's grippy, resistant, and bouncy, thanks to its Zoom Air unit. Its lightweight nature allowed us to run up and down the court, and its court sensibility makes it suit guards' typical playstyle, just like Tatum himself. However, the lack of rearfoot support in this Jordan was quite disappointing. Its unsteady structure made us lose confidence in our playtests.",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/jordan-tatum-1",
      "score": 83,
      "price_min": 70,
      "price_max": 135,
      "sentiment_score": 8.0,
      "sentiment_label": "positive",
      "source": "runrepeat",
      "keywords_performance": [
        "grip",
        "support"
      ],
      "keywords_playstyle": [
        "guard"
      ],
      "keywords_features": [
        "zoom air"
      ],
      "keywords_technologies": [
        "air",
        "zoom"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Air Jordan XXXVIII review: The Air Jordan XXXVIII became our instant top pick in multiple categories as the shoe kept checking every box in all of our lab and play tests! We found it a perfectly well-rounded hoop shoe that nails every essential feature to help you perform your best on the court. But above all, this Jordan shoe inspires plenty of confidence with its stellar support and stability even during our most forceful lateral cuts. And did we mention that it weighs lighter than the average mid-cut shoe? In a word, this is a rare example of a high-priced basketball shoe that is actually worth every penny, in our opinon.",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/air-jordan-xxxviii",
      "score": 87,
      "price_min": 130,
      "price_max": 200,
      "sentiment_score": 6.54,
      "sentiment_label": "neutral",
      "source": "runrepeat",
      "keywords_performance": [
        "support",
        "stability"
      ],
      "keywords_technologies": [
        "air"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Adidas Trae Young 2 review: For us, the Adidas Trae Young 2 is arguably better than the one that came before it, and this makes it a shoe that is definitely worth buying. We are sure that those who want to make the best out of their purchases are going to have fun with this, as well. Aside from being a performance beast on the court, we found that this shoe also has the looks that make it suitable for casual use. When you get this, it's like getting two shoes for the price of one.",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/adidas-trae-young-2",
      "score": 80,
      "price_min": 95,
      "price_max": 160,
      "sentiment_score": 6.58,
      "sentiment_label": "neutral",
      "source": "runrepeat"
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Adidas Dame Certified review: Damian Lillard has finally released a budget signature shoe, and we couldn't be any happier with the results it got in our tests! We've found it's incredibly durable, stable, comfortable, and ready for your hoops outdoors. It lets you feel every bit of the court so you can perform at an NBA point guard level, and it does it with style! Even though heel slippage might be an issue, we've confirmed a runners knot or double socks easily get rid of the problem. If you want a shoe that boosts your attacks as well as your confidence, we definitely recommend this supportive pal!",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/adidas-dame-certified",
      "score": 85,
      "price_min": 85,
      "price_max": 140,
      "sentiment_score": 6.67,
      "sentiment_label": "neutral",
      "source": "runrepeat",
      "keywords_performance": [
        "support"
      ],
      "keywords_playstyle": [
        "guard"
      ],
      "keywords_features": [
        "boost"
      ],
      "keywords_court_type": [
        "outdoor"
      ],
      "keywords_comfort": [
        "comfortable",
        "heel slip"
      ],
      "keywords_durability": [
        "durable"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: New Balance TWO WXY V4 review: We believe that the TWO WXY V4 from New Balance is a safe pick because it satisfactorily checks all of the hoop shoe essentials. While it does not excel in any performance aspects aside from durability during our tests, it leaves no room for complaints. It works for us, and it's all that matters.",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/new-balance-two-wxy-v4",
      "score": 83,
      "price_min": 120,
      "price_max": 170,
      "sentiment_score": 5.0,
      "sentiment_label": "neutral",
      "source": "runrepeat"
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: PUMA Rise Nitro review: For a moderately-priced basketball shoe, the PUMA Rise Nitro proved to be an excellent value for money. We found it to be a well-balanced option that suits various types of players. Based on our wear tests, there is no shortage of comfort, cushioning, or support in this PUMA shoe. Add to that the shoe's clean and minimalist aesthetic and you get a hoop shoe that's hard to ignore.",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/puma-rise-nitro",
      "score": 83,
      "price_min": 125,
      "price_max": 170,
      "sentiment_score": 10.0,
      "sentiment_label": "positive",
      "source": "runrepeat",
      "keywords_performance": [
        "cushioning",
        "support"
      ],
      "keywords_durability": [
        "wear"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Nike Cosmic Unity 2 review: The Nike Cosmic Unity 2 does not disappoint even after we have been so impressed with the original Cosmic Unity from the previous year. We believe it is of the same level as top performers like the Nike KD 15. Given all this, it is not a surprise that this basketball shoe has become a solid contender for the Best Shoe of the Year title.",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/nike-cosmic-unity-2",
      "score": 85,
      "price_min": 135,
      "price_max": 170,
      "sentiment_score": 6.93,
      "sentiment_label": "neutral",
      "source": "runrepeat"
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Jordan Zion 3 review: The Zions are back and ready to absolutely break with everything you had seen before in their line! This third iteration features a reinforced and durable upper that offers a snug fit and a wonderful lockdown feel. This surefootedness also comes from all the padding it has, as well as from its magnificent ankle support. Our surprise when we were testing this Jordan pair was not only the sole flare in the forefoot, but also in the midfoot! We felt incredibly stable when we landed, and the big Zoom Air unit located in the ball of the foot provided us with some bounce every time we went for a quick move. The only drawback here is that such a close-to-the-foot structure and solid upper mean that wide-foot hoopers will most likely feel uncomfortable and cramped in the Zion 3.",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/jordan-zion-3",
      "score": 68,
      "price_min": 135,
      "price_max": 200,
      "sentiment_score": 5.0,
      "sentiment_label": "neutral",
      "source": "runrepeat",
      "keywords_performance": [
        "support",
        "lockdown",
        "bounce"
      ],
      "keywords_playstyle": [
        "quick"
      ],
      "keywords_features": [
        "zoom air"
      ],
      "keywords_comfort": [
        "comfortable",
        "wide",
        "snug",
        "padding"
      ],
      "keywords_durability": [
        "durable"
      ],
      "keywords_technologies": [
        "air",
        "zoom"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Nike Air Max Impact 4 review: We are delighted with the Nike Air Max Impact 4 as it managed to go beyond the already high standards set by the Air Max Impact 3 performance-wise. Traction, cushioning, support, and comfort - we found that the Air Max Impact 4 surely delivers on aspects that matter, making it a perfect value-for-money option for an entry-level player.",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/nike-air-max-impact-4",
      "score": 83,
      "price_min": 80,
      "price_max": 150,
      "sentiment_score": 7.95,
      "sentiment_label": "positive",
      "source": "runrepeat",
      "keywords_performance": [
        "traction",
        "cushioning",
        "support"
      ],
      "keywords_features": [
        "air max"
      ],
      "keywords_technologies": [
        "air"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Nike Air Zoom G.T. Cut 2 review: We confirmed that the Nike Air Zoom G.T. Cut 2 is the ultimate shoe for those who are fond of a generous, plush, and bouncy type of cushioning. But we think that it might just as well be a detractor for players in need of strong lateral support because of all that cushioning.",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/nike-air-zoom-g-t-cut-2",
      "score": 84,
      "price_min": 130,
      "price_max": 190,
      "sentiment_score": 0.0,
      "sentiment_label": "negative",
      "source": "runrepeat",
      "keywords_performance": [
        "cushioning",
        "support"
      ],
      "keywords_technologies": [
        "air",
        "zoom"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Nike KD 15 review: The releases from the KD line are hits, and the Nike KD 15 is not an exemption. This basketball shoe energizes our every step without forgetting to protect our feet from impact upon aggressive strikes and hard landings. We discovered that dust is also not a problem, and the grip is indeed consistent even on unkempt floors. Its collar is not as high, but the curved structure of the heel locks in our foot extra securely. We also think that it's apparent that a lot of careful thought was poured into the design process of this Nike offer.",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/nike-kd-15",
      "score": 92,
      "price_min": 135,
      "price_max": 160,
      "sentiment_score": 0.0,
      "sentiment_label": "negative",
      "source": "runrepeat",
      "keywords_performance": [
        "grip"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Reebok Answer IV review: The Reebok Answer IV is a standout retro model that honors Allen Iverson. For us, this shoe is a no-brainer, especially since we are suckers for classic leather silhouettes that are immensely durable and supportive. Even though this Reebok shoe falls short of proper cushioning and other features of a high-performance hoop shoe, it still performs decent on the court. But if you consider it for your casual sneaker collection, we think that the Answer IV is a fantastic offering with a rich background.",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/reebok-answer-iv",
      "score": 88,
      "price_min": 130,
      "price_max": 170,
      "sentiment_score": 7.5,
      "sentiment_label": "positive",
      "source": "runrepeat",
      "keywords_performance": [
        "cushioning",
        "support"
      ],
      "keywords_features": [
        "leather"
      ],
      "keywords_durability": [
        "durable"
      ],
      "keywords_materials": [
        "leather"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Nike Precision 6 review: We found that the Nike Precision releases have always satisfied those players who are on a budget, and the Precision 6 is not an exception. This budget shoe from Nike delivers on aspects that matter when it comes to performance. It's even comfortable enough to be worn the whole day without much issue. Indeed, we got our money's worth with the Nike Precision 6.",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/nike-precision-6",
      "score": 84,
      "price_min": 75,
      "price_max": 160,
      "sentiment_score": 10.0,
      "sentiment_label": "positive",
      "source": "runrepeat",
      "keywords_comfort": [
        "comfortable"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  },
  {
    "text": "Description: Reebok Answer DMX review: We were thrilled about the comeback of the Answer DMX, with all its updates and familiar features. This Reebok Classics shoe carries a vivid 90's vibe and pays tribute to the great Allen Iverson. Even though we didn't find the same funky DMX air technology of the old, this shoe still surprised us with excellent impact protection. In addition, its comfort and durability make it well worth the price tag. It's not the best for performance but it can surely handle a game or two.",
    "metadata": {
      "shoe_name": "",
      "brand": "",
      "model": "",
      "url": "https://runrepeat.com/reebok-answer-dmx",
      "score": 90,
      "price_min": 130,
      "price_max": 170,
      "sentiment_score": 6.88,
      "sentiment_label": "neutral",
      "source": "runrepeat",
      "keywords_performance": [
        "impact protection"
      ],
      "keywords_technologies": [
        "air"
      ]
    },
    "id": "runrepeat_",
    "source": "runrepeat"
  }
]